cmsis-svd/cmsis-svd/data/NXP/LPC11Exx_v5.svd
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>PWMC</name>																					
		<description>PWM Control Register. The PWMCON enables PWM mode for the external match pins CT32Bn_MAT[3:0].</description>																					
		<addressOffset>0x074</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>PWMEN0</name>																			
				<description>PWM mode enable for channel0.</description>																			
				<bitRange>[0:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>CT32BN_MAT0_IS_CONTR</name>																	
						<description>CT32Bn_MAT0 is controlled by EM0.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>PWM_MODE_IS_ENABLED_</name>																	
						<description>PWM mode is enabled for CT32Bn_MAT0.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>PWMEN1</name>																			
				<description>PWM mode enable for channel1.</description>																			
				<bitRange>[1:1]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>CT32BN_MAT01_IS_CONT</name>																	
						<description>CT32Bn_MAT01 is controlled by EM1.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>PWM_MODE_IS_ENABLED_</name>																	
						<description>PWM mode is enabled for CT32Bn_MAT1.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>PWMEN2</name>																			
				<description>PWM mode enable for channel2.</description>																			
				<bitRange>[2:2]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>CT32BN_MAT2_IS_CONTR</name>																	
						<description>CT32Bn_MAT2 is controlled by EM2.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>PWM_MODE_IS_ENABLED_</name>																	
						<description>PWM mode is enabled for CT32Bn_MAT2.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>PWMEN3</name>																			
				<description>PWM mode enable for channel3. Note: It is recommended to use match channel 3 to set the PWM cycle.</description>																			
				<bitRange>[3:3]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>CT32BN_MAT3_IS_CONTR</name>																	
						<description>CT32Bn_MAT3 is controlled by EM3.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>PWM_MODE_IS_ENABLED_</name>																	
						<description>PWM mode is enabled for CT132Bn_MAT3.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>																			
				<bitRange>[31:4]</bitRange>																			
																						
			</field>																				
		</fields>																					
	</register>																						
</registers>
		</peripheral>
		
		
		<peripheral>
			<name>ADC</name>
			<description>ADC  </description>
			<groupName>ADC</groupName>
			<baseAddress>0x4001C000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC</name>
				<value>24</value>
			</interrupt>
			<registers>
				<register>
					<name>CR</name>
					<description>A/D Control Register. The CR register must be written to select the operating mode before A/D conversion can occur.</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>Selects which of the AD7:0 pins is (are) to be sampled and converted. Bit 0 selects Pin AD0, bit 1 selects pin AD1,..., and bit 7 selects pin AD7.  In software-controlled mode (BURST = 0), only one channel can be selected, i.e. only one of these bits should be 1.  In hardware scan mode (BURST = 1), any numbers of channels can be selected, i.e any or all bits can be set to 1. If all bits are set to 0, channel 0 is selected automatically (SEL = 0x01).</description>
							<bitRange>[7:0]</bitRange>

