cmsis-svd/cmsis-svd/data/NXP/LPC11Exx_v5.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PMU</name>
			<description> Power Management Unit (PMU)  </description>
			<groupName>PMU</groupName>
			<baseAddress>0x40038000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PCON</name>
					<description>Power control register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PM</name>
							<description>Power mode</description>
							<bitRange>[2:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DEFAULT</name>
									<description>Default. The part is in active or sleep mode.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEEPSLEEP</name>
									<description>ARM WFI will enter Deep-sleep mode.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERDOWN</name>
									<description>ARM WFI will enter Power-down mode.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEEPPOWERDOWN</name>
									<description>ARM WFI will enter Deep-power down mode (ARM Cortex-M0 core powered-down).</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NODPD</name>
							<description>A 1 in this bit prevents entry to Deep power-down mode when 0x3 is written to the PM field above, the SLEEPDEEP bit is set, and a WFI is executed. Execution continues after the WFI if this bit is 1.  This bit is cleared only by power-on reset, so writing a one to this bit locks the part in a mode in which Deep power-down mode is blocked.</description>
							<bitRange>[3:3]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[7:4]</bitRange>

						</field>
						<field>
							<name>SLEEPFLAG</name>
							<description>Sleep mode flag</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>NOPOWERDOWN</name>
									<description>Read: No power-down mode entered. LPC11U1x is in Active mode. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>POWERDOWN</name>
									<description>Read: Sleep/Deep-sleep or Deep power-down mode entered. Write: Writing a 1 clears the SLEEPFLAG bit to 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[10:9]</bitRange>

						</field>
						<field>
							<name>DPDFLAG</name>
							<description>Deep power-down flag</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DPNOTENTERED</name>
									<description>Read: Deep power-down mode  not entered. Write: No effect.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DPENTERED</name>
									<description>Read: Deep power-down mode entered. Write: Clear the Deep power-down flag.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[31:12]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<dim>4</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-3</dimIndex>
					<name>GPREG%s</name>
					<description>General purpose register 0</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GPDATA</name>
							<description>Data retained during Deep power-down mode.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>GPREG4</name>
					<description>General purpose register 4</description>
					<addressOffset>0x014</addressOffset>
					<access>read-write</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RESERVED</name>
							<description>Reserved. Do not write ones to this bit.</description>
							<bitRange>[9:0]</bitRange>

						</field>
						<field>
							<name>WAKEUPHYS</name>
							<description>WAKEUP pin hysteresis enable</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Hysteresis for WAKEUP pin disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Hysteresis for WAKEUP pin enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GPDATA</name>
							<description>Data retained during Deep power-down mode.</description>
							<bitRange>[31:11]</bitRange>

						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
	<name>FLASHCTRL</name>
	<description> Flash programming firmware Modification </description>
	<groupName>FLASHCTRL</groupName>
	<baseAddress>0x4003C000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>FLASH_IRQ</name>
	<value>27</value>
	</interrupt>
	<registers>
		<register>
			<name>EEMSSTART</name>
			<description>EEPROM BIST start address register</description>
			<addressOffset>0x09C</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STARTA</name>
					<description>BIST start address: Bit 0 is fixed zero since only even addresses are allowed.</description>
					<bitRange>[13:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EEMSSTOP</name>
			<description>EEPROM BIST stop address register</description>
			<addressOffset>0x0A0</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>STOPA</name>
					<description>BIST stop address: Bit 0 is fixed zero since only even addresses are allowed.</description>
					<bitRange>[13:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[29:14]</bitRange>
				</field>
				<field>
					<name>DEVSEL</name>
					<description>BIST device select bit 0: the BIST signature is generated over the total memory space. Singe pages are interleaved over the EEPROM devices when multiple devices are used, the signature is generated over memory of multiple devices. 1: the BIST signature is generated only over a memory range located on a single EEPROM device. Therefore the internal address generation is done such that the  address' CS bits are kept stable to select only the same device. The address' MSB and LSB bits are used to step through the memory range specified by the start and stop address fields. Note: if this bit is set the start and stop address fields must be programmed such that they both address the same EEPROM device. Therefore the address' CS bits in both the start and stop address must be the same.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>STRTBIST</name>
					<description>BIST start bit Setting this bit will start the BIST. This bit is self-clearing.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EEMSSIG</name>
			<description>EEPROM 24-bit BIST signature register</description>
			<addressOffset>0x0A4</addressOffset>
			<access>read-only</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA_SIG</name>
					<description>BIST 16-bit signature calculated from only the data bytes</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>PARITY_SIG</name>
					<description>BIST 16-bit signature calculated from only the parity bits of the data bytes</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>FLASHCFG</name>
			<description>Flash memory access time configuration register</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>FLASHTIM</name>
					<description>Flash memory access time. FLASHTIM +1 is equal to the number of system clocks used for flash access.</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>1_SYSTEM_CLOCK_FLASH</name>
							<description>1 system clock flash access time (for system clock frequencies of up to 20 MHz).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>2_SYSTEM_CLOCKS_FLAS</name>
							<description>2 system clocks flash access time (for system clock frequencies of up to 40 MHz).</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>3_SYSTEM_CLOCKS_FLAS</name>
							<description>3 system clocks flash access time (for system clock frequencies of up to 50 MHz).</description>
							<value>0x2</value>
						</enumeratedValue>
						
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. User software must not change the value of these bits. Bits 31:2 must be written back exactly as read.</description>
					<bitRange>[31:2]</bitRange>
				
