cmsis-svd/cmsis-svd/data/NXP/LPC11Exx_v5.svd
			</field>																				
			<field>																				
				<name>OD</name>																			
				<description>Open-drain mode.</description>																			
				<bitRange>[10:10]</bitRange>																			
																							
				<enumeratedValues>																			
				<name>ENUM</name>																			
																							
					<enumeratedValue>																		
						<name>DISABLE_</name>																	
						<description>Disable.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>OPEN_DRAIN_MODE_ENAB</name>																	
						<description>Open-drain mode enabled.  This is not a true open-drain mode.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:11]</bitRange>																			
																							
																					
			</field>																				
		</fields>																					
	</register>																						
																							
																							
</registers>																							

</peripheral>


		<peripheral>
	<name>SYSCON</name>
	<description>System control block  </description>
	<groupName>SYSCON</groupName>
	<baseAddress>0x40048000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
		<registers>																							
	<register>																						
		<name>SYSMEMREMAP</name>																					
		<description>System memory remap</description>																					
		<addressOffset>0x000</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>MAP</name>																			
				<description>System memory remap. Value 0x3 is reserved.</description>																			
				<bitRange>[1:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>BOOT_LOADER_MODE_IN</name>																	
						<description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>USER_RAM_MODE_INTER</name>																	
						<description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>USER_FLASH_MODE_INT</name>																	
						<description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved</description>																			
				<bitRange>[31:2]</bitRange>																			
																						
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>PRESETCTRL</name>																					
		<description>Peripheral reset control</description>																					
		<addressOffset>0x004</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>SSP0_RST_N</name>																			
				<description>SSP0 reset control</description>																			
				<bitRange>[0:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>RESETS_THE_SSP0_PERI</name>																	
						<description>Resets the SSP0 peripheral.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SSP0_RESET_DE_ASSERT</name>																	
						<description>SSP0 reset de-asserted.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>I2C_RST_N</name>																			
				<description>I2C reset control</description>																			
				<bitRange>[1:1]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>RESETS_THE_I2C_PERIP</name>																	
						<description>Resets the I2C peripheral.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>I2C_RESET_DE_ASSERTE</name>																	
						<description>I2C reset de-asserted.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>SSP1_RST_N</name>																			
				<description>SSP1 reset control</description>																			
				<bitRange>[2:2]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>RESETS_THE_SSP1_PERI</name>																	
						<description>Resets the SSP1 peripheral.</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SSP1_RESET_DE_ASSERT</name>																	
						<description>SSP1 reset de-asserted.</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved</description>																			
				<bitRange>[3:3]</bitRange>																			
																						
