cmsis-svd/cmsis-svd/data/NXP/LPC11Exx_v5.svd
			</field>																				
			<field>																				
				<name>WWDT</name>																			
				<description>Enables clock for WWDT.</description>																			
				<bitRange>[15:15]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLE</name>																	
						<description>Disable</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLE</name>																	
						<description>Enable</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>IOCON</name>																			
				<description>Enables clock for I/O configuration block.</description>																			
				<bitRange>[16:16]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLE</name>																	
						<description>Disable</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLE</name>																	
						<description>Enable</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved</description>																			
				<bitRange>[17:17]</bitRange>																			
																						
			</field>																				
			<field>																				
				<name>SSP1</name>																			
				<description>Enables clock for SSP1.</description>																			
				<bitRange>[18:18]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLE</name>																	
						<description>Disable</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLE</name>																	
						<description>Enable</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>PINT</name>																			
				<description>Enables clock to GPIO Pin interrupts register interface.</description>																			
				<bitRange>[19:19]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLE</name>																	
						<description>Disable</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLE</name>																	
						<description>Enable</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved</description>																			
				<bitRange>[22:20]</bitRange>																			
																						
			</field>																				
			<field>																				
				<name>GROUP0INT</name>																			
				<description>Enables clock to GPIO GROUP0 interrupt register interface.</description>																			
				<bitRange>[23:23]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLE</name>																	
						<description>Disable</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLE</name>																	
						<description>Enable</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>GROUP1INT</name>																			
				<description>Enables clock to GPIO GROUP1 interrupt register interface.</description>																			
				<bitRange>[24:24]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLE</name>																	
						<description>Disable</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLE</name>																	
						<description>Enable</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved</description>																			
				<bitRange>[25:25]</bitRange>																			
																						
			</field>																				
			<field>																				
				<name>RAM1</name>																			
				<description>Enables clock for the SRAM block at address range 0x2000 0000 to 0x2000 0800.</description>																			
				<bitRange>[26:26]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DISABLE</name>																	
						<description>Disable</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>ENABLE</name>																	
						<description>Enable</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved</description>																			
				<bitRange>[31:27]</bitRange>																			
																						
