cmsis-svd/cmsis-svd/data/NXP/LPC11Exx_v5.svd
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.  Always write this bit as 1.</description>																			
				<bitRange>[10:10]</bitRange>																			
																						
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.  Always write this bit as 1.</description>																			
				<bitRange>[11:11]</bitRange>																			
																						
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.  Always write this bit as 0.</description>																			
				<bitRange>[12:12]</bitRange>																			
																						
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved. Always write these bits as 111.</description>																			
				<bitRange>[15:13]</bitRange>																			
																						
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved</description>																			
				<bitRange>[31:16]</bitRange>																			
																						
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>PDRUNCFG</name>																					
		<description>Power configuration register</description>																					
		<addressOffset>0x238</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0xEDF0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>IRCOUT_PD</name>																			
				<description>IRC oscillator output power-down</description>																			
				<bitRange>[0:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>POWERED</name>																	
						<description>Powered</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>POWERED_DOWN</name>																	
						<description>Powered down</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>IRC_PD</name>																			
				<description>IRC oscillator power-down</description>																			
				<bitRange>[1:1]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>POWERED</name>																	
						<description>Powered</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>POWERED_DOWN</name>																	
						<description>Powered down</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>FLASH_PD</name>																			
				<description>Flash power-down</description>																			
				<bitRange>[2:2]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>POWERED</name>																	
						<description>Powered</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>POWERED_DOWN</name>																	
						<description>Powered down</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>BOD_PD</name>																			
				<description>BOD power-down</description>																			
				<bitRange>[3:3]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>POWERED</name>																	
						<description>Powered</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>POWERED_DOWN</name>																	
						<description>Powered down</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>ADC_PD</name>																			
				<description>ADC power-down</description>																			
				<bitRange>[4:4]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>POWERED</name>																	
						<description>Powered</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>POWERED_DOWN</name>																	
						<description>Powered down</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>SYSOSC_PD</name>																			
				<description>Crystal oscillator power-down</description>																			
				<bitRange>[5:5]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>POWERED</name>																	
						<description>Powered</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>POWERED_DOWN</name>																	
						<description>Powered down</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>WDTOSC_PD</name>																			
				<description>Watchdog oscillator power-down</description>																			
				<bitRange>[6:6]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>POWERED</name>																	
						<description>Powered</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>POWERED_DOWN</name>																	
						<description>Powered down</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>SYSPLL_PD</name>																			
				<description>System PLL power-down</description>																			
				<bitRange>[7:7]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>POWERED</name>																	
						<description>Powered</description>																	
						<value>0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>POWERED_DOWN</name>																	
						<description>Powered down</description>																	
						<value>1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.  Always write this bit as 1.</description>																			
				<bitRange>[8:8]</bitRange>																			
																						
